result/thread-pool/throughput-latency.txt
Warm-up: 8 threads, 10k connections, 2 minutes
wrk -t8 -c10000 -d120s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/100 | tee performance.txt 
sleep 15
# Pressure: 8 threads, 10k connections, 10 minutes, API dealy: 0.1 s, 0.2 s, 0.5 s
wrk -t8 -c10000 -d600s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/100 | tee -a performance.txt
sleep 15
wrk -t8 -c10000 -d600s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/200 | tee -a performance.txt
sleep 15
wrk -t8 -c10000 -d600s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/500 | tee -a performance.txt
Running 2m test @ http://10.152.0.2:8080/benchmark/delay/100
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   324.22ms  144.57ms   2.04s    91.60%
    Req/Sec     4.00k     1.11k    5.25k    83.88%
  Latency Distribution
     50%  273.35ms
     75%  316.91ms
     90%  432.00ms
     99%  993.21ms
  3807592 requests in 2.00m, 392.71MB read
Requests/sec:  31707.74
Transfer/sec:      3.27MB
Running 10m test @ http://10.152.0.2:8080/benchmark/delay/100
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   281.61ms   40.12ms   1.08s    89.75%
    Req/Sec     4.46k   583.13     7.88k    88.21%
  Latency Distribution
     50%  271.30ms
     75%  277.70ms
     90%  316.89ms
     99%  444.60ms
  21299335 requests in 10.00m, 2.15GB read
Requests/sec:  35493.33
Transfer/sec:      3.66MB
Running 10m test @ http://10.152.0.2:8080/benchmark/delay/200
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   533.76ms   26.79ms 644.62ms   97.13%
    Req/Sec     2.35k   395.64     7.37k    82.12%
  Latency Distribution
     50%  536.30ms
     75%  539.88ms
     90%  543.91ms
     99%  560.90ms
  11232556 requests in 10.00m, 1.13GB read
Requests/sec:  18718.29
Transfer/sec:      1.93MB
Running 10m test @ http://10.152.0.2:8080/benchmark/delay/500
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.33s   160.65ms   1.57s    74.23%
    Req/Sec     1.20k     0.88k    4.55k    69.39%
  Latency Distribution
     50%    1.42s 
     75%    1.45s 
     90%    1.45s 
     99%    1.46s 
  4492514 requests in 10.00m, 463.44MB read
Requests/sec:   7487.12
Transfer/sec:    790.89KB